Revit 2027 API
BuiltInFailures.RebarFailures.TooLargeNumberOfBars Property
 The number of bars in the set cannot exceed 1002.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId TooLargeNumberOfBars { get; }
Public Shared ReadOnly Property TooLargeNumberOfBars As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ TooLargeNumberOfBars {
	FailureDefinitionId^ get ();
}
static member TooLargeNumberOfBars : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.RebarFailures Class
Autodesk.Revit.DB Namespace